{
    "version": "https://jsonfeed.org/version/1",
    "title": "Fee Calculator",
    "description": "",
    "home_page_url": "https://blog.fee-calculator.com",
    "feed_url": "https://blog.fee-calculator.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Finn"
    },
    "items": [
        {
            "id": "https://blog.fee-calculator.com/fiverr-myths-debunked/",
            "url": "https://blog.fee-calculator.com/fiverr-myths-debunked/",
            "title": "Fiverr Myths Debunked",
            "summary": "12 Myths that new sellers should know the truth about If you are a new seller on Fiverr, chances are that you have heard many tips and tricks about how to rank your gig, how to increase impressions and clicks. If you struggle to get&hellip;",
            "content_html": "<h1><strong>12 Myths that new sellers should know the truth about</strong></h1>\n<p><span style=\"font-weight: 400;\">If you are a new seller on Fiverr, chances are that you have heard many tips and tricks about how to rank your gig, how to increase impressions and clicks. If you struggle to get your first order or the impressions on your gigs are very low, then you might wonder why. </span>Some of these seem <strong>obvious</strong>, but I've seen so many new sellers fall for this \"quick and easy money\" tips. <span style=\"font-weight: 400;\">Unfortunately, there are too many people giving bad advice to new sellers. </span></p>\n<h3><span style=\"font-weight: 400;\">Tips (myths) for easy success on Fiverr</span></h3>\n<ul>\n<li>\n<p><strong>Stay Online 24/7</strong></p>\n</li>\n<li><strong>Instant responses and 100% response rate</strong></li>\n<li><strong>Gig rotation can be influenced</strong></li>\n<li><strong>Review exchange can boost your Fiverr gig performance</strong></li>\n<li><strong>Offering free work to get reviews</strong></li>\n<li><strong>Send as many buyers requests as possible (or react to the new buyer request matches)</strong></li>\n<li><strong>Promote your Fiverr gigs on Social Media</strong></li>\n<li><strong>Fiverr is easy and fast money</strong></li>\n<li><strong>Fiverr and Paypal have no fees</strong></li>\n<li><strong>Making money on Fiverr is passive income</strong></li>\n<li><strong>Anybody can be successful on Fiverr</strong></li>\n<li><strong>Success is based on luck</strong></li>\n</ul>\n<p><em><strong>They will be debunked now, for good. </strong></em></p>\n<p><strong><span style=\"font-weight: 400;\">That's why I wrote this guide for new sellers on Fiverr to clear out some of the myths that have spread around the internet about how you can rank your gig. </span></strong>So if you see any other Fiverr seller giving you one of these 12 tips, just post this gif and leave the chat. 😎</p>\n<p>If you need a Fiverr discord server with experienced sellers, feel free to join the Fiverr Insiders community. <a href=\"https://disboard.org/server/1008862116205301841\" title=\"Disboard Fiverr Insiders\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">https://disboard.org/server/1008862116205301841</a></p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.fee-calculator.com/media/posts/4/no-michael-scott.gif\" alt=\"\" width=\"640\" height=\"522\"></figure>\n<h2><strong>Fiverr Myth #1 - Stay Online 24/7</strong></h2>\n<p><span style=\"font-weight: 400;\">Staying online 24/7 to boost your gig ranking performance is a myth and does not help at all. No single human can be online all the time, only bots and auto refreshers can. Fiverr might consider your account suspicious when it is online 24/7.</span></p>\n<p><span style=\"font-weight: 400;\">Additionally, if you are online, get a message but are not able to properly answer your client (because you actually sleep) it will make a much worse impression than answering when you are back online. </span></p>\n<p><span style=\"font-weight: 400;\">When a client sees your gig and the gig is well made, with promising work samples and a well made and concise gig description, the client will be compelled to message you. Not because you are online, but because your work looks promising! </span></p>\n<p><span style=\"font-weight: 400;\">What's more important than your online time is your answer rate and your average response time.</span></p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://blog.fee-calculator.com/media/posts/4/fall_asleep_desk.gif\" alt=\"\" width=\"300\" height=\"218\">\n<figcaption >human trying to be online 24/7 to get as many fiverr orders as possible</figcaption>\n</figure>\n<h2><strong>Fiverr Myth #2 - Instant responses and 100% response rate</strong></h2>\n<blockquote>\n<p><span style=\"font-weight: 400;\">Instant responses with a very low response rate increase gig traffic and ranking.</span></p>\n</blockquote>\n<p><span style=\"font-weight: 400;\">It is true that the response time matters. Remember you have 24 Hours to respond! After that it will negatively affect your response rate and this will in turn have a negative effect on your gig ranking &amp; impressions. So keeping a 100% is possible and important for your gig ranking. But it is easy to do it yourself. There is no need for automatic responses that will automatically keep your response rate at 100%. Be careful about that response rate, because it can derank you if you already have a Fiverr Seller Level.</span></p>\n<p>But what is important when responding to some one in your Fiverr inbox that seems interested in your services? <span style=\"font-weight: 400;\">What clients actually want is an honest, concise answer of you will be the right choice. Show your client a solution strategy  and how you would tackle their problem. This will increase their confidence to make the right decision when hiring you. </span></p>\n<h2><strong>Fiverr Myth #3 - Gig rotation</strong></h2>\n<p><span style=\"font-weight: 400;\">Gig rotation was a thing on early Fiverr, but since the freelancing platform has seen a massive growth in new sellers and buyers, the simple rotation of gigs to the first places in search results is over. New sellers need to be way more thoughtful about their gig category and service niché when creating a new gig. Some categories are so overwhelmed with offers and are so competitive, that you will have a hard time starting out. </span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\">But, if you use correct keywords, preferably keywords that are not overused by other sellers, you have a good chance of landing your first orders and gaining a reputation as a good seller. Getting 5-star reviews will help boost your gig ranking and performance and increase your impression and click rate a lot. </span></p>\n<p><span style=\"font-weight: 400;\">Fiverr gig rotation is a myth, but it's not 100% untrue. The search results have improved a lot since the early days of Fiverr and now they are tightly based on the buyers portfolio as well as the sellers skills.</span></p>\n<p><span style=\"font-weight: 400;\">The rotation is there, but it's minimal. There is randomness involved. It only switches around the gigs when the results show, but Fiverr will not randomly rotate gigs down and up the search results. The algorithm is much more advanced than that. </span></p>\n<h2><strong>Fiverr Myth #4 - Review exchange can boost your Fiverr gig performance</strong></h2>\n<div>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://blog.fee-calculator.com/media/posts/4/no_1.gif\" alt=\"\" width=\"384\" height=\"480\">\n<figcaption ><span style=\"font-weight: 400;\">No, no, no…</span></figcaption>\n</figure>\n<p><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit;\">Review exchange is against Fiverr’s terms of service and will get you banned quickly. It is also very obvious. Fake reviews are also not worth it.</span></p>\n</div>\n<p><span style=\"font-weight: 400;\">Reviews do not have the weight as they used to be, but reviews from Fiverr Select buyers, or repeating buyer reviews are something that can really boost your gigs ranking. </span></p>\n<p><span style=\"font-weight: 400;\">Reviews that did not come from your amazing work and professional attitude will just result in your gig or account being banned. </span><span style=\"font-weight: 400;\">If anybody offers you a review exchange or suggests it to you, block them and move on. </span></p>\n<h2><strong>Fiverr Myth #5 - Offering free work can help you get started</strong></h2>\n<p><span style=\"font-weight: 400;\">A big no from me. This is very bad advice in my opinion! Offering free work will put you in a bad light. There is no reason that you should ever offer your work for free. People will reach out to you and you might get some exposure by offering free work, but in the end these people are only going to use you and won’t ever see you as a freelancer who they need to pay.</span></p>\n<p><em><strong>Stick to your prices, know your worth and the worth of your work. </strong></em></p>\n<p>There is an exception to this rule. If you don't have the proper skills to offer services, then you should not trick any buyer into spending money on  you. Its okay to build your portfolio with projects from others. I still recommend you to find your own ideas for projects, these will help you learn much more than doing work for free. </p>\n<h2><strong>Fiverr Myth # 6 - Send as many buyers requests as possible</strong></h2>\n<p><span style=\"font-weight: 400;\">Sending all possible buyers requests is not worth your time and will not help you get sales and orders quicker. Only send buyers requests that you think you can actually provide a valuable offer for. Take the time and write a detailed solution strategy and why the client should hire you. Don't go overboard and write too much. Be concise and try to make a sale! </span><span style=\"font-weight: 400;\">Spamming those buyer requests won't help your gig performance or conversion<strong> at all</strong>.</span></p>\n<h2><strong>Fiverr Myth #7 - Promote your Fiverr gigs on Social Media</strong></h2>\n<p><span style=\"font-weight: 400;\">It has been said before, but posting your gigs on your personal social media account wont help you at all. These people that you will reach through your promotion are not potential clients. Find out better ways to promote your Fiverr gigs and try to reach out directly to potential buyers. Read more about “How to promote your Fiverr gigs on Discord” in our upcoming guide. There you will learn how you can use Discord for promoting directly to your target audience and build a network of potential clients.</span></p>\n<h2><strong>Fiverr Myth #8 - Fiverr is easy and fast money</strong></h2>\n<p><span style=\"font-weight: 400;\">Not at all. Fiverr is a highly competitive marketplace with low prices and very skilled freelancers offering their work. If you do not put in the time to create a gig that sticks out and follows all the rules of SEO, with good work samples, then you will have a very hard time on Fiverr. </span></p>\n<p><span style=\"font-weight: 400;\">You need a skillset that people are willing to pay money for, otherwise it is unlikely that you will get easy and fast money, if any. </span></p>\n<h2><strong>Fiverr Myth #9 - Fiverr and Paypal have no fees</strong></h2>\n<p><span style=\"font-weight: 400;\">Fiverr does have a 20% fee for sellers. The fiverr fees are what they are and it's not a small amount of money. Additionally, the withdrawal on Fiverr can also include fees from Payoneer, the Fiverr Revenue Card or through PayPals currency conversion fees.</span></p>\n<p><span style=\"font-weight: 400;\">Luckily, you can keep track of your fiverr fees using the<a href=\"https://fee-calculator.com/fiverr_calculator\" title=\"Fiverr Fees Calculator\" target=\"_blank\" rel=\"noopener noreferrer\"> Fiverr Fees Calculator</a>.</span></p>\n<p>Use it to determine your hourly rate after all the fees were calculated. 👍</p>\n<figure class=\"post__image post__image--wide\"><img loading=\"lazy\"  src=\"https://blog.fee-calculator.com/media/posts/4/fiverr_calculator_insights.jpg\" alt=\"\" width=\"1082\" height=\"721\" sizes=\"100vw\" srcset=\"https://blog.fee-calculator.com/media/posts/4/responsive/fiverr_calculator_insights-xs.jpg 300w ,https://blog.fee-calculator.com/media/posts/4/responsive/fiverr_calculator_insights-sm.jpg 480w ,https://blog.fee-calculator.com/media/posts/4/responsive/fiverr_calculator_insights-md.jpg 768w ,https://blog.fee-calculator.com/media/posts/4/responsive/fiverr_calculator_insights-lg.jpg 1024w ,https://blog.fee-calculator.com/media/posts/4/responsive/fiverr_calculator_insights-xl.jpg 1360w ,https://blog.fee-calculator.com/media/posts/4/responsive/fiverr_calculator_insights-2xl.jpg 1600w\"></figure>\n<h2><strong>Fiverr Myth #10 - Making money on Fiverr is passive income</strong></h2>\n<p><span style=\"font-weight: 400;\">Many people that post and comment about their Fiverr experience label their income as passive income. That is NOT the case! Fiverr orders have to be actively worked on, sometimes with unexpected challenges and more effort than you anticipated. Having a successful Fiverr profile, even for some easy side money / beermoney, Fiverr requires sellers to be active alot. You need to answer messages, respond properly to get orders, and update your gigs. Only the process of researching a category that you can create your gig in, writing optimized descriptions and titles can take a lot of work if done right. </span><span style=\"font-weight: 400;\"><br><br></span></p>\n<p><span style=\"font-weight: 400;\">Calling making money on Fiverr passive income is just plain wrong. But, it can be less stressful than a side job (as a student for example) because you can always decide yourself how much work you take on. So as a side hustle for easy money it can be a great opportunity, but it's never passive. Your Fiverr Seller profile always needs your attention, otherwise it will go downhill quickly.</span></p>\n<h2><strong>Fiverr Myth #11 - Anybody can be successful on Fiverr</strong></h2>\n<p><span style=\"font-weight: 400;\">In a way that is true. It is true, because anybody can learn valuable skills these days. YouTube is full of free tutorials, you can find virtually any question answered through Google or DuckDuckGo. There are huge amounts of resources on any skill you like to learn. </span></p>\n<p><span style=\"font-weight: 400;\">But, without a valuable skill that people are willing to pay real money for, you are never going to be successful on Fiverr. It's the hard truth, but if you are here to look for fast and easy money on Fiverr, I can tell you with certainty that you are on a path that is never gonna lead to success.</span></p>\n<h2>Fiverr Myth #12 - Success is based on luck</h2>\n<blockquote>\n<p>You cannot make it on Fiverr or as a Freelancer. Oonly lucky people or very smart people can be successful. You should just give up. </p>\n</blockquote>\n<p>But thats not the case. You can. Everyone can. If they want it hard enough. 😎</p>\n<p><span style=\"font-weight: 400;\">Pick a skill that you want to provide and <strong>LEARN AND MASTER IT</strong>. Put in the time and effort, ask other people who have those skills for feedback. </span></p>\n<p><strong>Improve, fail, improve, and repeat. </strong></p>\n<p><span style=\"font-weight: 400;\">Until you finally have the skills that you need to be successful on Fiverr.</span></p>\n<p><span style=\"font-weight: 400;\">These skills can include programming, search engine optimization skills, advanced photo editing and many many more. The more difficult the skill is to learn, the better people will pay you for your work. That's the way it works in the business world and Fiverr is no exception.</span></p>\n<p><span style=\"font-weight: 400;\">So get started today. Stop wasting time. Learn the skills you need and improve them until you have the tools to be successful. </span></p>\n<p><strong>Thanks for reading and good luck!</strong></p>",
            "image": "https://blog.fee-calculator.com/media/posts/4/fiverr_myth_debunked.jpg",
            "author": {
                "name": "Finn"
            },
            "tags": [
                   "fiverr myths",
                   "fiverr gig",
                   "fiverr fees",
                   "fiverr"
            ],
            "date_published": "2023-01-22T20:06:53+01:00",
            "date_modified": "2023-01-24T00:38:51+01:00"
        },
        {
            "id": "https://blog.fee-calculator.com/how-to-create-a-video-thumbnail-on-your-fiverr-gig/",
            "url": "https://blog.fee-calculator.com/how-to-create-a-video-thumbnail-on-your-fiverr-gig/",
            "title": "How to create a video thumbnail to boost your Fiverr gig",
            "summary": "Creating a video thumbnail for your Fiverr gig can boost your search ranking and click rate. In this guide you will learn step by step how to create your own video thumbnail for your Fiverr gig. Creating a video is not easy if you don’t have&hellip;",
            "content_html": "<p>Creating a video thumbnail for your Fiverr gig can boost your search ranking and click rate. In this guide you will learn step by step how to create your own video thumbnail for your Fiverr gig. Creating a video is not easy if you don’t have experience in Adobe software, but in this guide you will learn how to create a video thumbnail for your Fiverr gig using free tools.</p>\n<p>But first, let me show you the results of using a video thumbnail for your Fiverr gig. It has a visible impact and it will improve your chances of success on Fiverr.</p>\n<h2>Higher impressions on Fiverr gig after uploading a video thumbnail</h2>\n<p>When you are having problems with your gig impressions and click rate, creating a video for your thumbnail is one of the best ways to increase your gig ranking performance. It will boost your gig impressions and also result in a higher click rate.</p>\n<p>You can see here how uploading a video thumbnail boosted my Fiverr gig ranking. It resulted in alot more impressions and clicks on my gig and it directly helped me get more orders. Follow my tutorial on how to create a Fiverr video thumbnail to gain more exposure on the Fiverr gig ranking.</p>\n<figure ><figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.fee-calculator.com/media/posts/3/fiverr_gig_performance_1.png\" alt=\"fiverr gig boost after uploading video thumbnail\" width=\"346\" height=\"268\" sizes=\"100vw\" srcset=\"https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_gig_performance_1-xs.png 300w ,https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_gig_performance_1-sm.png 480w ,https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_gig_performance_1-md.png 768w ,https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_gig_performance_1-lg.png 1024w ,https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_gig_performance_1-xl.png 1360w ,https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_gig_performance_1-2xl.png 1600w\"></figure>\n<figcaption >Fiverr gig boost after uploading a video thumbnail</figcaption>\n</figure>\n<p>But, how do you create a video that will help your Fiverr gig performance?</p>\n<p>If you are not a professional with video editing software like Adobe Premiere and After Effects, you can use a free video editor that I found and used for my own Fiverr gig video. It is easy to use and gives you the option to choose different animation / transitions.</p>\n<p> </p>\n<h2>Step 1 – Collect your best work samples</h2>\n<p>This is a crucial step! You want amazing work samples to showcase in the video, this is more important than anything else. If you don’t have a lot of work samples, my advice is that you create more personal projects so you have enough work samples for your Fiverr gig video.</p>\n<p>Great work samples need to fulfill these requirements:</p>\n<ul>\n<li>showing the best of your abilities</li>\n<li>be proof of the quality that you promise to provide</li>\n<li>have a realistic purpose, but do not have to be real client work</li>\n<li>do not have any errors or mistakes in them</li>\n<li>easy to understand</li>\n</ul>\n<h2>Step 2 – Create animated images inforgraphics with Pixlr</h2>\n<p>This free image editor allows you to create images and edit your work samples. You could add arrows for example. Then, you can use their animaton tool for images. It will create a cool animation of your image elements which you can use in your Fiverr video thumbnail.</p>\n<figure class=\"post__image post__image--left\"><img loading=\"lazy\"  src=\"https://blog.fee-calculator.com/media/posts/3/animate-image-pixlr.gif\" alt=\"Use animated images for your Fiverr video thumbnail\" width=\"348\" height=\"220\"></figure><figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.fee-calculator.com/media/posts/3/flexclip_page_animation.png\" alt=\"animations for image transitions\" width=\"191\" height=\"230\" sizes=\"100vw\" srcset=\"https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_page_animation-xs.png 300w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_page_animation-sm.png 480w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_page_animation-md.png 768w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_page_animation-lg.png 1024w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_page_animation-xl.png 1360w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_page_animation-2xl.png 1600w\"></figure>\n<p>You can simply select one of the animation styles (some are free, some are only for premium) but the freebies are very good and sufficient for creating an enganging Fiverr video thumbnail.</p>\n<p> </p>\n<h2>Step 3 – Use flexclip for easily creating free video thumbnails for Fiverr</h2>\n<p>Now when you have work samples and animated images ready, you can start creating and editing your video thumbnail for Fiverr in this free video editor. <a href=\"https://www.flexclip.com/editor/app?ratio=landscape\">https://www.flexclip.com/editor/app?ratio=landscape</a></p>\n<p>It is a free tool and super easy to use. They also have a lot of templates to use as starting point, but I suggest you start with an empty project and create everything yourself. It is not as difficult as it seems if you follow this guide on how to create a video for Fiverr thumbnail step by step!</p>\n<h2>Step 4 – Import Media to Flexclip</h2>\n<p>Create a new video project on flexflip and import your media. Images, videos, anything you created in the first steps and that you want to show in the video thumbnail when someone sees your Fiverr gig in the search results.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.fee-calculator.com/media/posts/3/flexclip_import.png\" alt=\"import your own media\" width=\"532\" height=\"411\" sizes=\"100vw\" srcset=\"https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_import-xs.png 300w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_import-sm.png 480w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_import-md.png 768w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_import-lg.png 1024w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_import-xl.png 1360w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_import-2xl.png 1600w\"></figure>\n<p> </p>\n<h2>Step 5 – Drag and drop all your samples and animated images into the timeline</h2>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.fee-calculator.com/media/posts/3/flexclip_animated_images.png\" alt=\"video thumbnail creation step 5\" width=\"504\" height=\"477\" sizes=\"100vw\" srcset=\"https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_animated_images-xs.png 300w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_animated_images-sm.png 480w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_animated_images-md.png 768w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_animated_images-lg.png 1024w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_animated_images-xl.png 1360w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_animated_images-2xl.png 1600w\"></figure>\n<p>After you imported your media files to the video editor, you can start drag and dropping the images and animated images onto the timeline (in the bottom)</p>\n<p> </p>\n<h2>Step 6 – Arrange your media on the timeline of your video thumbnail</h2>\n<p>After you have arranged everything in the order you want the video to showcase your work, you can start to add transitions and animations. Click on each image in the timeline and then select the animation menu from the top bar.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.fee-calculator.com/media/posts/3/flexclip_video_timeline.png\" alt=\"video thumbnail creation step 6\" width=\"588\" height=\"449\" sizes=\"100vw\" srcset=\"https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_video_timeline-xs.png 300w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_video_timeline-sm.png 480w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_video_timeline-md.png 768w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_video_timeline-lg.png 1024w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_video_timeline-xl.png 1360w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_video_timeline-2xl.png 1600w\"></figure>\n<p> </p>\n<h2>Step 7 – Animate your images</h2>\n<p>The animation menu will show and allow you to pick an animation for the image. I like the zoom in and out options. But be careful not to overuse the animations. It’s a good idea to only use it on the most special images.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.fee-calculator.com/media/posts/3/flexclip_animate.png\" alt=\"animate images for your video thumbnail\" width=\"588\" height=\"438\" sizes=\"100vw\" srcset=\"https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_animate-xs.png 300w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_animate-sm.png 480w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_animate-md.png 768w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_animate-lg.png 1024w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_animate-xl.png 1360w ,https://blog.fee-calculator.com/media/posts/3/responsive/flexclip_animate-2xl.png 1600w\"></figure>\n<p> </p>\n<h2>Step 8 – Find a free soundtrack</h2>\n<p>There are tons of musicians that offer their music and sounds for free on the internet!</p>\n<p><a href=\"https://pixabay.com/music/\">https://pixabay.com/music/</a></p>\n<p>Pixabay for example is a great resource for music and soundtracks. If you like, you can credit the musician for their free work. But it is not a neccesity.</p>\n<p>Always make sure you use music and images that are royalty free, meaning you can freely use them, otherwise Fiverr will delete your video thumbnail and might even deactivate your gig or ban your account. So make sure to use soundtracks from Pixabay in your Fiverr video thumbnail.</p>\n<p>You can use the keyword “cinematic” for example to find epic soundtracks. Depending on your Fiverr gig, you want to search for different soundtracks that fit your video thumbnail best.</p>\n<h4><strong>Example cinematic soundtracks</strong></h4>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.fee-calculator.com/media/posts/3/free_soundtrack.png\" alt=\"example cinematic soundtracks\" width=\"732\" height=\"230\" sizes=\"100vw\" srcset=\"https://blog.fee-calculator.com/media/posts/3/responsive/free_soundtrack-xs.png 300w ,https://blog.fee-calculator.com/media/posts/3/responsive/free_soundtrack-sm.png 480w ,https://blog.fee-calculator.com/media/posts/3/responsive/free_soundtrack-md.png 768w ,https://blog.fee-calculator.com/media/posts/3/responsive/free_soundtrack-lg.png 1024w ,https://blog.fee-calculator.com/media/posts/3/responsive/free_soundtrack-xl.png 1360w ,https://blog.fee-calculator.com/media/posts/3/responsive/free_soundtrack-2xl.png 1600w\"></figure>\n<p>Source: <a href=\"https://pixabay.com/music/search/cinematic/\">https://pixabay.com/music/search/cinematic/</a></p>\n<p> </p>\n<h2>Step 9 - Add the Audio to your video thumbnail</h2>\n<p>Now  that you have selected a soundtrack / music for your Fiverr gig, you can add it the video in the video editor by clicking on the Add Audio button in the bottom left.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.fee-calculator.com/media/posts/3/add_audio_fiverr_video.png\" alt=\"add audio to your video\" width=\"502\" height=\"220\" sizes=\"100vw\" srcset=\"https://blog.fee-calculator.com/media/posts/3/responsive/add_audio_fiverr_video-xs.png 300w ,https://blog.fee-calculator.com/media/posts/3/responsive/add_audio_fiverr_video-sm.png 480w ,https://blog.fee-calculator.com/media/posts/3/responsive/add_audio_fiverr_video-md.png 768w ,https://blog.fee-calculator.com/media/posts/3/responsive/add_audio_fiverr_video-lg.png 1024w ,https://blog.fee-calculator.com/media/posts/3/responsive/add_audio_fiverr_video-xl.png 1360w ,https://blog.fee-calculator.com/media/posts/3/responsive/add_audio_fiverr_video-2xl.png 1600w\"></figure>\n<p> </p>\n<h2>Step 6 – Upload your new video thumbnail to your Fiverr gig page</h2>\n<p>On your Fiverr dashboard, open your gigs table. There, click the gig you want to add the video thumbnail to. Click edit.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.fee-calculator.com/media/posts/3/fiverr_edit_01.jpg\" alt=\"upload video thumbnail to your fiverr gig\" width=\"385\" height=\"130\" sizes=\"100vw\" srcset=\"https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_edit_01-xs.jpg 300w ,https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_edit_01-sm.jpg 480w ,https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_edit_01-md.jpg 768w ,https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_edit_01-lg.jpg 1024w ,https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_edit_01-xl.jpg 1360w ,https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_edit_01-2xl.jpg 1600w\"></figure>\n<p>This will open your gigs detailed edit view. Select Gallery there, scroll down and add your video to your Fiverr gig.</p>\n<p> </p>\n<h2>Step 7 – Manually select a thumbnail for your video thumbnail</h2>\n<p>Fiverr automatically selects a random thumbnail from the video. It’s a random frame so you might want to selec tit manually so the video thumbnail shows up exactly as you planned in the search results of Fiverr.</p>\n<figure ><figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.fee-calculator.com/media/posts/3/fiverr_edit_02.png\" alt=\"select fiverr video thumbnail\" width=\"796\" height=\"363\" sizes=\"100vw\" srcset=\"https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_edit_02-xs.png 300w ,https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_edit_02-sm.png 480w ,https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_edit_02-md.png 768w ,https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_edit_02-lg.png 1024w ,https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_edit_02-xl.png 1360w ,https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_edit_02-2xl.png 1600w\"></figure>\n<figcaption >Select Fiverr video thumbnail manually</figcaption>\n</figure>\n<p>After clicking the edito video button on your Fiverr gig, you can select the preview thumbnail manually. All you have to do is stop at the right time and Click “Set as Preview”.</p>\n<figure ><figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://blog.fee-calculator.com/media/posts/3/fiverr_edit_03.png\" alt=\"select video frame that will be the gig preview\" width=\"521\" height=\"138\" sizes=\"100vw\" srcset=\"https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_edit_03-xs.png 300w ,https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_edit_03-sm.png 480w ,https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_edit_03-md.png 768w ,https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_edit_03-lg.png 1024w ,https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_edit_03-xl.png 1360w ,https://blog.fee-calculator.com/media/posts/3/responsive/fiverr_edit_03-2xl.png 1600w\"></figure>\n<figcaption >Set frame as preview thumbnail</figcaption>\n</figure>\n<h1>Conclusion</h1>\n<p>That’s it! Save your gig and wait a minute or two for the changes to be reflected in the Fiverr search results. Then search for your gig and check your new video thumbnail. Congratulations, you made it through. Now you have a good chance of increasing your Fiverr gigs peformance. The impressions will go up and your click rate will be higher than before. Its almost guaranteed.</p>\n<p>Good luck with your future adventure as a seller on Fiverr!</p>",
            "image": "https://blog.fee-calculator.com/media/posts/3/add-video-to-fiverr-gig.jpg",
            "author": {
                "name": "Finn"
            },
            "tags": [
                   "video thumbnail",
                   "fiverr gig",
                   "fiverr fees",
                   "fiverr"
            ],
            "date_published": "2023-01-22T18:56:23+01:00",
            "date_modified": "2023-01-23T04:15:41+01:00"
        }
    ]
}
